const DELTA_SAMPLE = [
  {"insert": "البُن (الاسم العلمي: Coffea) هو جنس من النباتات يتبع الفصيلة الفوية من رتبة الجنطيانيات. "},
  {
    "insert": "@ويكيبيدا",
    // "attributes": {"mention": "https://ar.wikipedia.org/wiki/%D8%A8%D9%86"}
    "attributes": {
      "mention": {"displayName": "ويكيبيديا", "userName": "wikipedia", "uid": "brWfmsiewnb"}
    }
  },
  {
    "insert":
        " البُن (الاسم العلمي: Coffea) هو جنس من النباتات يتبع الفصيلة الفوية من رتبة الجنطيانيات. والبن شجرة دائمة الخضرة ذات ثمار حمراء اللون في حالة نضجها، وتحتوي على مكونات قد تكون ضارة بالصحة مثل الكافيين. غير أن إحدى أحدث الأبحاث العلمية أشارت إلى انخفاض في نسبة المصابين بالنوع الثاني من داء السكري بين الذين يتناولون القهوة، وبالأخص القهوة منزوعة الكافيين. كما أن له تأثيرات سلبية سيئة على الذاكرة المؤقتة، فقد نشرت إذاعة بي بي سي على موقعها بتاريخ 20 يوليو 2004 خبر دراسة من المدرسة الدولية للدراسات المتقدمة في إيطاليا يقول بأن الكافيين يمكن أن يعيق الذاكرة المؤقتة وتذكر بعض الأسماء. لذلك يشار للطلاب باجتناب شرب القهوة والشاي والكوكا وغيرها من الأشياء المحتوية على مادة الكافيين دائماً وخاصة أيام الامتحانات.\n"
  },
  {
    "insert": {"divider": true}
  },
  {
    "insert": {
      "image": {"nid": "1y8FVAEzn#un(_wkd7XBRfU4)", "user": "9ukEt3oZUGUdzHz2JhElKKkGuw42", "dims": null}
    }
  },
  {"insert": "شجرة البن"},
  {
    "insert": "\n",
    "attributes": {"h2": true}
  },
  {
    "insert":
        "تنمو شجرة البن طبيعياً في المناخ الاستوائي الذي يكون حاراً رطباً في موسم النمو، وحاراً جافاً في موسم القطاف.\nالقهوة بالعربية هي كل ما يشرب على مهل وبعد اكتشاف البن انحسر الاسم على المشروب المصنوع من البن. أما الاسم كافي فقد أتى من اسم مكتشف القهوة أو من اكتشفها والذي سمي المشروب باسمه بادِئ الأمر وهو الشيخ الصوفي الكاف وكانت تسمى قهوة الكاف وحينما أتى البرتغاليون لليمن واحتلوا المكلا وعدن وجدوا المشروب فحملوه للعالم وباسمه الأصلي مع تحريفات بسيطة.\n"
  },
  {
    "insert": {"divider": true}
  },
  {"insert": "القهوة من راعي الغنم إلى الكاباتشينو"},
  {
    "insert": "\n",
    "attributes": {"h2": true}
  },
  {
    "insert":
        "تُروى حكاية قديمة عن أن راعياً فُوجئ بغنمه، وقد اعترتها حالة غير عادية من الحيوية والنشاط، عندما أكلت من شجيرة معينة. لم يستغرق الأمر من الراعي وقتا طويلا حتى قرر أن يتناول هو الآخر بعضاً من هذه البذور؛ ليجربها بنفسه، ويكتشف الأثر الواضح لزيادة نشاطه وحيويته، وكان هذا سبباً في اكتشاف شجرة البن التي يُصنع منها مشروب القهوة، الذي يعد من أكثر المشروبات انتشارا واستهلاكا في العالم. وقد قيل أن أول من اهتدى إليها هو أبو بكر بن عبد الله العيدروس وكان أصل اتخاذه لهذه البذرة أنه مر في أحد سياحاته (وقد كان صوفيا) بشجرة فأكل من ثمرها حين رآه متروكاً لا ينتفع به أحد مع كثرته فوجد به تجفيفا للدماغ واجتلاباً للسهر وتنشيطاً للعبادة فاتخذه قوتاً وشراباً وطعاماً وأرشد أتباعه إليه ثم نشر ذلك في الحجاز واليمن ومصر.\n"
  },
  {
    "insert": {
      "image": {"nid": "jhydlb@0I#un(fANEvguCIXE)", "user": "9ukEt3oZUGUdzHz2JhElKKkGuw42", "dims": null}
    }
  },
  {"insert": "أنواع القهوة"},
  {
    "insert": "\n",
    "attributes": {"h2": true}
  },
  {
    "insert": "القهوة العربية",
    "attributes": {"bold": true}
  },
  {
    "insert":
        ": قهوة خفيفة التركيز توضع فيها حبات الهيل والبهار أو البزار المستخدم لإضافة نكهة ورائحة زكية ومميزة عند أهل البادية والحضر من العرب عامة وأهل الخليج خاصة، والتي تكون قهوتهم صفراء مائلة للّون البني الذهبي وهناك القهوة الشماليّة الغامقة اللون والأكثر تركيزاً التي تعتبر قهوة أهل العراق وبلاد الشام، وعادة تكون مرة وليس فيها سكر أبداً، وتقدم في فنجان يختلف عن فنجان القهوة المتعارف عليه في تركيا وأوروبا حيث يكون فمه أوسع من قاعدته وتقدم به القهوة بحيث لا تملأ إلا نصفه على أكثر تقدير."
  },
  {
    "insert": "\n",
    "attributes": {"list": "bullet"}
  },
  {
    "insert": "القهوة الأمريكية",
    "attributes": {"bold": true}
  },
  {"insert": ": تطلق على قهوة الفلتر مجازاً. وهي تصنع غالباً من حبات القهوة الكولومبية."},
  {
    "insert": "\n",
    "attributes": {"list": "bullet"}
  },
  {
    "insert": "القهوة التركية",
    "attributes": {"bold": true}
  },
  {
    "insert":
        ": هي قهوة ثقيلة غامقة، تصنع على الأغلب من حبات القهوة البرازيلية. تطحن بدرجة ناعمة جداً وتختلف في درجة تحضيرها بغليها جيداً أو الغلي السريع. تقدم في فنجان صغير بيد مع صحن صغير، وتعتبر فناجين القهوة التركية الأكثر شهرة واستخداما وتتميز بزخرفتها، كما يقدم معها السكر بدرجات متفاوتة حسب الرغبة."
  },
  {
    "insert": "\n",
    "attributes": {"list": "bullet"}
  },
  {
    "insert": {"video": "https://www.youtube.com/embed/YIHBJE4llnY?showinfo=0"}
  },
  {"insert": "هذه القصة معاينة لمحرر \"كلمة\". المصدر: "},
  {
    "insert": "ويكيبيدا",
    "attributes": {"link": "https://ar.wikipedia.org/wiki/%D8%A8%D9%86"}
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  }
];

const DELTA_SAMPLE_WITH_ERROR_2 = [
  {"insert": "السلام عليكم!\n"},
  {
    "insert": {"video": "https://www.youtube.com/embed/LJf0wPMEuFA"}
  },
  {
    "insert": {"tweet": "1285569646624739331"}
  },
  {
    "insert": {"video": "https://www.youtube.com/embed/LJf0wPMEuFA"}
  },
  {"insert": "\ndasdasdasdasd"},
  {
    "insert": {"video": "https://www.youtube.com/embed/LJf0wPMEuFA"}
  },
];
