const DELTA_SAMPLE = [
  {"insert": "البُن (الاسم العلمي: Coffea) هو جنس من النباتات يتبع الفصيلة الفوية من رتبة الجنطيانيات. "},
  {
    "insert": "@ويكيبيدا",
    // "attributes": {"mention": "https://ar.wikipedia.org/wiki/%D8%A8%D9%86"}
    "attributes": {
      "mention": {"displayName": "ويكيبيديا", "userName": "wikipedia", "uid": "brWfmsiewnb"}
    }
  },
  {
    "insert":
        " البُن (الاسم العلمي: Coffea) هو جنس من النباتات يتبع الفصيلة الفوية من رتبة الجنطيانيات. والبن شجرة دائمة الخضرة ذات ثمار حمراء اللون في حالة نضجها، وتحتوي على مكونات قد تكون ضارة بالصحة مثل الكافيين. غير أن إحدى أحدث الأبحاث العلمية أشارت إلى انخفاض في نسبة المصابين بالنوع الثاني من داء السكري بين الذين يتناولون القهوة، وبالأخص القهوة منزوعة الكافيين. كما أن له تأثيرات سلبية سيئة على الذاكرة المؤقتة، فقد نشرت إذاعة بي بي سي على موقعها بتاريخ 20 يوليو 2004 خبر دراسة من المدرسة الدولية للدراسات المتقدمة في إيطاليا يقول بأن الكافيين يمكن أن يعيق الذاكرة المؤقتة وتذكر بعض الأسماء. لذلك يشار للطلاب باجتناب شرب القهوة والشاي والكوكا وغيرها من الأشياء المحتوية على مادة الكافيين دائماً وخاصة أيام الامتحانات.\n"
  },
  {
    "insert": {"divider": true}
  },
  {
    "insert": {
      "image": {"nid": "1y8FVAEzn#un(_wkd7XBRfU4)", "user": "9ukEt3oZUGUdzHz2JhElKKkGuw42", "dims": null}
    }
  },
  {"insert": "شجرة البن"},
  {
    "insert": "\n",
    "attributes": {"h2": true}
  },
  {
    "insert":
        "تنمو شجرة البن طبيعياً في المناخ الاستوائي الذي يكون حاراً رطباً في موسم النمو، وحاراً جافاً في موسم القطاف.\nالقهوة بالعربية هي كل ما يشرب على مهل وبعد اكتشاف البن انحسر الاسم على المشروب المصنوع من البن. أما الاسم كافي فقد أتى من اسم مكتشف القهوة أو من اكتشفها والذي سمي المشروب باسمه بادِئ الأمر وهو الشيخ الصوفي الكاف وكانت تسمى قهوة الكاف وحينما أتى البرتغاليون لليمن واحتلوا المكلا وعدن وجدوا المشروب فحملوه للعالم وباسمه الأصلي مع تحريفات بسيطة.\n"
  },
  {
    "insert": {"divider": true}
  },
  {"insert": "القهوة من راعي الغنم إلى الكاباتشينو"},
  {
    "insert": "\n",
    "attributes": {"h2": true}
  },
  {
    "insert":
        "تُروى حكاية قديمة عن أن راعياً فُوجئ بغنمه، وقد اعترتها حالة غير عادية من الحيوية والنشاط، عندما أكلت من شجيرة معينة. لم يستغرق الأمر من الراعي وقتا طويلا حتى قرر أن يتناول هو الآخر بعضاً من هذه البذور؛ ليجربها بنفسه، ويكتشف الأثر الواضح لزيادة نشاطه وحيويته، وكان هذا سبباً في اكتشاف شجرة البن التي يُصنع منها مشروب القهوة، الذي يعد من أكثر المشروبات انتشارا واستهلاكا في العالم. وقد قيل أن أول من اهتدى إليها هو أبو بكر بن عبد الله العيدروس وكان أصل اتخاذه لهذه البذرة أنه مر في أحد سياحاته (وقد كان صوفيا) بشجرة فأكل من ثمرها حين رآه متروكاً لا ينتفع به أحد مع كثرته فوجد به تجفيفا للدماغ واجتلاباً للسهر وتنشيطاً للعبادة فاتخذه قوتاً وشراباً وطعاماً وأرشد أتباعه إليه ثم نشر ذلك في الحجاز واليمن ومصر.\n"
  },
  {
    "insert": {
      "image": {"nid": "jhydlb@0I#un(fANEvguCIXE)", "user": "9ukEt3oZUGUdzHz2JhElKKkGuw42", "dims": null}
    }
  },
  {"insert": "أنواع القهوة"},
  {
    "insert": "\n",
    "attributes": {"h2": true}
  },
  {
    "insert": "القهوة العربية",
    "attributes": {"bold": true}
  },
  {
    "insert":
        ": قهوة خفيفة التركيز توضع فيها حبات الهيل والبهار أو البزار المستخدم لإضافة نكهة ورائحة زكية ومميزة عند أهل البادية والحضر من العرب عامة وأهل الخليج خاصة، والتي تكون قهوتهم صفراء مائلة للّون البني الذهبي وهناك القهوة الشماليّة الغامقة اللون والأكثر تركيزاً التي تعتبر قهوة أهل العراق وبلاد الشام، وعادة تكون مرة وليس فيها سكر أبداً، وتقدم في فنجان يختلف عن فنجان القهوة المتعارف عليه في تركيا وأوروبا حيث يكون فمه أوسع من قاعدته وتقدم به القهوة بحيث لا تملأ إلا نصفه على أكثر تقدير."
  },
  {
    "insert": "\n",
    "attributes": {"list": "bullet"}
  },
  {
    "insert": "القهوة الأمريكية",
    "attributes": {"bold": true}
  },
  {"insert": ": تطلق على قهوة الفلتر مجازاً. وهي تصنع غالباً من حبات القهوة الكولومبية."},
  {
    "insert": "\n",
    "attributes": {"list": "bullet"}
  },
  {
    "insert": "القهوة التركية",
    "attributes": {"bold": true}
  },
  {
    "insert":
        ": هي قهوة ثقيلة غامقة، تصنع على الأغلب من حبات القهوة البرازيلية. تطحن بدرجة ناعمة جداً وتختلف في درجة تحضيرها بغليها جيداً أو الغلي السريع. تقدم في فنجان صغير بيد مع صحن صغير، وتعتبر فناجين القهوة التركية الأكثر شهرة واستخداما وتتميز بزخرفتها، كما يقدم معها السكر بدرجات متفاوتة حسب الرغبة."
  },
  {
    "insert": "\n",
    "attributes": {"list": "bullet"}
  },
  {
    "insert": {"video": "https://www.youtube.com/embed/YIHBJE4llnY?showinfo=0"}
  },
  {"insert": "هذه القصة معاينة لمحرر \"كلمة\". المصدر: "},
  {
    "insert": "ويكيبيدا",
    "attributes": {"link": "https://ar.wikipedia.org/wiki/%D8%A8%D9%86"}
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  }
];

const DELTA_SAMPLE_WITH_ERROR = [
  {
    "insert": "2",
    "attributes": {"bold": true}
  },
  {
    "insert": "0",
    "attributes": {"italic": true}
  },
  {
    "insert": "2",
    "attributes": {"underline": true}
  },
  {"insert": "0"},
  {
    "insert": "\n",
    "attributes": {"blockquote": true, "header": 1}
  },
  {
    "insert":
        "\nعزيزي القارئ ،\nهذه المره لا أوجه النص لك او لكِ ، هذا المقال لـ طفلك وطفلتك الذين يكبرون أمامك وتطمح بإن تراهم في اعلى المناصب ..\nوإن كان هناك رأي أخر ، يرجى توجيهه إلى الدوله التي من الممكن إن يهمها أمر مستقبل الاجيال .. \n\nهيا نبـدأ .. ✍🏻"
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {
    "insert":
        "هل لي إن آخذك إلى عالم غير هذا العالـم ؟\nهل لي إن اجعل مخيلتك إن تتخيل بإننا أصبحنا الان في عام ٢٠٣٠ ثــم أعيد ألة الزمن إلى شبـاط عام ٢٠٢٠ ؟\n\nف"
  },
  {
    "insert": "ضلاً وليس امراً .... اجعل مخيلتك الان في عام ٢٠٢٠ ",
    "attributes": {"italic": true, "bold": true}
  },
  {
    "insert":
        "\n\n٠ هل تسمح لي إن ؛ اجعلك تصبح من قـارئ مستلقي على السرير أو في غرفة معيشتك إلى معلـم في مرحلة الابتدائية أو الاعدادية كما تسمى ؟\n٠ هل تسمح لي إن ؛ أسرقكَ إلى مخيلتي وترى جيلٌ هُدمّ من الاجيال القادمة في ذات العام ؟ \n٠ هل تتحمل إن ؛ أوقّف عنك الاوكسجين عاماً كاملاً أو بعبارةٌ اخرى إن اجعلك تتنفس فقط ٤ ساعات في اليوم ؟\n٠ هل لي إن ؛ استهينَ في عقلك ثم احاسبك على أفعالك او اهمالك على سقوطك ؟\n\n\".... كي يكون لديك علماً ....\""
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {
    "insert":
        "٠ الطفل الذي كان يحبي ويبكي وينامُ في المهد\nسوف يكبر ويسألنا عن الغــد ..\n٠ الطفل الذي كان يرسم شمس ومنزل بدفتر الرسـم\nسوف يكبر ويسألنا عن الغــد ..\n٠ الطفل الذي كان يحبي على ركبتيّه أصبح يمشـي \nوها هو مستعد للغـد ..\n٠ والطفل الذي كان يرسم ويلون في دفترهُ ، تخَرجَ \nوالان هو مستعـد للغـد ..\n\nهُنا أجمل ما قيل عن المعلم وأهميته في التعليم :"
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {
    "insert":
        "* في قوله الكريم في سورة المائدة :\n\"مَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ ۗ وَاللَّهُ يَعْلَمُ مَا تُبْدُونَ وَمَا تَكْتُمُونَ\". صدق الله العظيم\n\n* ولا ننسى ما قالهُ أمير الشعراء أحمد شوقي بقصيدتهُ :\nقم للمعلم وفِّهِ التبجيلا ٠٠ كاد المعلم أن يكون رسولا\n\nهُنا السؤال .."
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {
    "insert":
        "هل المعلم كان يؤدي البلاغ بكامل الصورة؟\nأو\nهل كانت الادارة المختصة للتعليم هي المخطئه بعدم استعدادها للتعليم عن بُعد؟\nأو \nهل فايروس كورونا كانت تعلم بإنها دمرت جيلاً كاملاً أو المسؤولين هم من دمرو المستقبل في هذه الحقيبة الوزارية؟ \n\nرسـاله إلى من يهمه الامر :"
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {"insert": "٠"},
  {
    "insert": " عزيزتـي كورونـا",
    "attributes": {"bold": true}
  },
  {
    "insert":
        " .. على الرغم إنكِ لا تعزي علي لكن \nأنتِ من قمتي بسرقة جيلاً كان بإمكانه إن يجد لكِ هذا اللقاح او مضاداً للقضاء عليكِ ..\n٠"
  },
  {
    "insert": " عزيزتي كورونـا ",
    "attributes": {"bold": true}
  },
  {
    "insert":
        ".. التي لا اجد لكِ أي ذرةّ حب ،، إنكِ استطعتِ بإن تجعلي المعلم ثـُرثاراً ، مجرد انه يتحدث من خلال جهازه الالكتروني وهو مُرتدي بجامته وهو يعلم بإن الطفل يُجيب على الاسأله عبر الانترنت او بمساعدة من بجانبـه ..\n"
  },
  {
    "insert": "٠ عزيزتي كورونـا",
    "attributes": {"bold": true}
  },
  {
    "insert":
        " .. هل لي ان أجد سلالتكِ الفايروسية لتذوقي ما هو شعور الفقد والحرمان بمن تحُب بفايروس مشابه لاعراض الزكام ؟\n\n\""
  },
  {
    "insert":
        "كورونـا وهي جالسه أمامي على مكتبها وخلفها صورة الرئيس السابق دونالد ترامب والرئيس الصيني شي جين بينغ وبيدها سيجـار ..\"",
    "attributes": {"italic": true, "bold": true}
  },
  {"insert": "\nهل تعلمين :"},
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {"insert": "بإنكِ استطعتي إن تجعلي التباعد في المجتمع هي صلة الرحم بيننا ..\nوهل تعلمين :"},
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {"insert": "إنكِ جعلتي الكمام والواقي مهم اكثر من المرء نفسهُ ..\nوهل تعلمين :"},
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {"insert": "بإنك استطعتي إن تجعلي الطبيب لا يجد لنفسه الطب ..\nوهل تعلمين :"},
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {"insert": "بإنكِ إقفلتِ أبواب المساجد بوجه المصلين ..\nوهل تعلمين :"},
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {"insert": "بإنك تسببتِ في احدى الدول بإن الكثير دُفن في مقبرة جماعيـه ..\nولا تعلمين أيضاً :"},
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {
    "insert":
        "بإن بعض الإدارات التي من المُفترض ان تحتويكِ كوباء خطر وتتم السيطره عليه ، كان لهم مصالح شخصيه ونجحوا في ذلك ..\nولا تعلمين :"
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {
    "insert":
        "بإن طالب المدرسة والجامعة أصبح يتفوق وينجح في مرحلة الدراسة دون فهم ما هو المقرر لهذا العام !!\nولا تعلمين :"
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {"insert": "بإن قدرة القادر الله عزوجل قادرة عليكِ وعلى من استهان في شعبه واطفاله .. \nولا تعلمين :"},
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {
    "insert":
        "بإنكِ كنتِ عباره عن حرب بيولوجية واقتصادية بين دول ،\nواظن انكِ لا تعلمين إنكِ صُنعتِ بفعل فاعـل ومؤامرة خبيثة ..\n\nوهناك الكثير ولكن دعونا من هذا الفايروس الذي لا يعرف الرحمة .."
  },
  {
    "insert": "\n",
    "attributes": {"list": "bullet"}
  },
  {"insert": "\nلنعود لكم ،،"},
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {
    "insert":
        "أعزائـي ..\nالحكمة من اجعلك تتخيل نفسك اننا في عام ٢٠٣٠ لنرى كيف أصبح طفل الامس الان ..\n\n اعتذار إلى من يهمه الأمر .."
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {
    "insert":
        "يا أيها الطفـل ،،\nأعتذر منك بإن الوبـاء نهب منك التعليم ، وبإن القائمين على مكافحة هذا الوبـاء قد سرقو منك عقلك ..\n\nيا أيها المتضرر من الفايروس ،،\nأعتذر لك ، إذ كان لك من يُعز عليك رحل عن الدُنيا بسبب هذا الوباء ..\n\nفي النهاية،"
  },
  {
    "insert": "\n",
    "attributes": {"blockquote": true}
  },
  {"insert": "إن كان هُناك رأي او تعليق او نقاش عن هذه الفلسفة والنـص ..\nف أنا مستعدٌ لهـا جداً ..\n\nحميم\n"},
];
